#include "EncodingDetector.hpp"
#include <fstream>
#include <iostream>

const uint8_t EncodingDetector::utf8d[] = {
  // Первая часть: 256 байт. Перевод байта в класс (0..11)
   0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,  0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
   0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,  0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
   0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,  0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
   0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,  0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
   1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,  9,9,9,9,9,9,9,9,9,9,9,9,9,9,9,9,
   7,7,7,7,7,7,7,7,7,7,7,7,7,7,7,7,  7,7,7,7,7,7,7,7,7,7,7,7,7,7,7,7,
   8,8,2,2,2,2,2,2,2,2,2,2,2,2,2,2,  2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,
  10,3,3,3,3,3,3,3,3,3,3,3,3,4,3,3, 11,6,6,6,5,8,8,8,8,8,8,8,8,8,8,8,

  // Вторая часть: 108 байт (9 строк по 12 элементов). Матрица переходов.
   0,12,24,36,60,96,84,12,12,12,48,72, 12,12,12,12,12,12,12,12,12,12,12,12,
  12, 0,12,12,12,12,12, 0,12, 0,12,12, 12,24,12,12,12,12,12,24,12,24,12,12,
  12,12,12,12,12,12,12,24,12,12,12,12, 12,24,12,12,12,12,12,12,12,24,12,12,
  12,12,12,12,12,12,12,36,12,36,12,12, 12,36,12,12,12,12,12,36,12,36,12,12,
  12,36,12,12,12,12,12,12,12,12,12,12, 
};

bool EncodingDetector::is_valid_utf8_file(const std::string& filepath) {
    std::ifstream file(filepath, std::ios::binary);
    if (!file.is_open()) {
        std::cerr << "[Detector] Ошибка: не удалось открыть " << filepath << " для анализа.\n";
        return false;
    }

    uint32_t state = UTF8_ACCEPT; // 0
    uint32_t codepoint = 0;
    char byte;

    while (file.get(byte)) {
        // Передаем байт в функцию (обязательно приводим к uint8_t, чтобы избежать отрицательных значений)
        decode(&state, &codepoint, static_cast<uint8_t>(byte));
        
        // Если попали в состояние ошибки (12), мгновенно прерываем чтение
        if (state == UTF8_REJECT) {
            file.close();
            return false;
        }
    }

    file.close();
    return state == UTF8_ACCEPT;
}